package by.academy.lesson3;
// . Ввести через консоль название месяца ->
//вывести номер месяца (использовать switch/case)
//1. Проинициализировать 3 целочисленных числа:
// a = 2_123_000
// b = 100
// c = 234
// Найти a / b * c
// Ответ: (4_967_820)

public class Task1 {
    public static void main(String[] args) {
        int a = 2_123_000;
        int b = 100;
        int c = 234;
        System.out.println(a/b*c);
    }
}
