package by.academy.classwork.lesson3;

//Составьте программу, выводящую на экран квадраты чисел от 10 до 20.

public class Task6 {
    public static void main(String[] args) {
        for (int i = 10; i < 20; i++) {
            System.out.println(i*i);
        }
    }
}
